int main()
{
int n = 420;
int q, w, e, r;
char *one[9] = {"îäèí", "äâà", "òðè", "÷îòèðè", "ï'ÿòü", "ø³ñòü", "ñ³ì", "â³ñ³ì", "äåâ'ÿòü"}; 
char *ten[9] = {"äåñÿòü ", "äâàäöÿòü", "òðèäöÿòü", "ñîðîê", "ï'ÿòäåñÿò", "øóñòäåñÿò", "ñ³ìäåñÿò", "â³ñ³ìäåñÿò", "äåâ'ÿíîñòî"}; 
char *hundred[9] = {"ñòî", "äâ³ñò³", "òðèñòà", "÷îòèðèñòà", "ï'ÿòñîò", "ø³ñòñîò", "ñ³ìñîò", "â³ñ³ìñîò", "äåâ'ÿòñîò"};  
char *thousand[9] = {"îäíà òèñÿ÷à", "äâ³ òèñÿ÷³", "òðè òèñÿ÷³", "÷îòèðè òèñÿ÷³", "ï'ÿòü òèñÿ÷", "ø³ñòü òèñÿ÷", "ñ³ì òèñÿ÷", "â³ñ³ì òèñÿ÷", "äåâ'ÿòü òèñÿ÷"}; 
char *tenplus1[9] = {"îäèíàäöÿòü", "äâàíàäöÿòü", "òðèíàäöÿòü", "÷îòèðíàäöÿòü", "ï'ÿòíàäöÿòü", "ø³ñòíàäöÿòü", "ñ³ìíàäöÿòü", "â³ñ³ìíàäöÿòü", "äåâ'ÿòíàäöÿòü"};   
char *result[4] = {"\0", "\0", "\0", "\0"}; 
r = n / 1000;
	if (r != 0) {
		result[0] = thousand[r-1];
	}
q = n / 100 % 10;
	if (q !=0 ) {
		result[1] = hundred[q-1];
	}
w = n % 100 / 10;
	if (w != 0) {
		result[2] = ten[w-1];
	}
e = n % 10;
result[3] = one[e-1];
if ( w == 1)
{
	result[2] = tenplus1[w-1];
	result[3]= "\0";
}
if ( w == 1 && e == 0)
{
	result [2] = ten[w-1];
	result[3] = "\0";
}
}
